/*
*********************************************************************************************************
ËµÃ÷£º
1.¶ÅÑÇÖÇÄÜ¼Ò¾Ó-Ãæ°åÀà³ÌÐòÄ£°å
2.²ÉÓÃ»ìºÏÊ½µ÷¶È³ÌÐò
3.·¢ËÍº¯Êý²ÉÓÃ×ÜÏß¾ºÕùËã·¨£¬°üÀ¨
	a.×ÜÏßÅÐ¶ÏÊÇ·ñ¿ÕÏÐ£¬Ã¦×ÅÍË³ö
	b.µÈ´ý¿ÕÏÐºó·¢ËÍÊý¾Ý
	c.·¢ËÍÍêÊý¾Ý£¬ÅÐ¶Ï½ÓÊÕ»º³åÇøµÄÊý¾ÝÊÇ·ñºÍ·¢ËÍ»º³åÇøµÄÒ»ÖÂ£¬²»Ò»ÖÂÔòÅÐ¶ÏÊ§°Ü£¬ÖØ·¢
	d.ÔÚÔ¤¶¨Ê±¼äÄÚµÈ´ý½ÓÊÕÖ÷»úµÄÓ¦´ð£¬³¬Ê±»ò³ö´í£¬ÔòÅÐ¶ÏÊ§°Ü£¬ÖØ·¢
	e.Ê§°ÜÖØ·¢×î¶à5´Î

*
*********************************************************************************************************
*/
#define MAIN_VARIABLE

#include "includes.h"


static void taskRxProcess(void);
static void AppTask_WirelessRecv(void);
static void AppTask_WirelessSend(void);
static void AppTask_Run(void);
void AppTask_RivalrySend(void);
void AppTask_BusMonitor(void);
void Check_Frame_Interval(void);
/*
*********************************************************************************************************
*	º¯ Êý Ãû: main
*	¹¦ÄÜËµÃ÷: c³ÌÐòÈë¿Ú
*	ÐÎ    ²Î£ºÎÞ
*	·µ »Ø Öµ: ´íÎó´úÂë(ÎÞÐè´¦Àí)
*********************************************************************************************************
*/
int main(void)
{
	NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x1800);
	
	
	bsp_Init();		    /* Ó²¼þ³õÊ¼»¯ */
	Dev_Init();				//
		
	/* Ìí¼Ó ¸öÈÎÎñ */
	//hSCH_Add_Task(AppTask_RivalrySend, 1, 1, 1);           		//¾ºÕù·¢ËÍÈÎÎñ Ã¿2mSµ÷ÓÃÒ»´Î
	hSCH_Add_Task(taskRxProcess, 2, 10, 1);  								 		//½ÓÊÕÈÎÎñ Ã¿10mSµ÷ÓÃÒ»´Î
	hSCH_Add_Task(AppTask_WirelessRecv, 3, 10, 1);        		 	//ÎÞÏß½ÓÊÕÈÎÎñ
	hSCH_Add_Task(AppTask_WirelessSend, 3, 20, 1);        	 		//ÎÞÏß·¢ËÍÈÎÎñ
	
	hSCH_Add_Task(AppTask_Run, 4, 10, 1);        						 		//ÔËÐÐÈÎÎñ //Ã¿10mSµ÷ÓÃÒ»´Î
	
	Led_set(0,100,100,3,1);	
  Led_set(1,100,100,3,2);		
	
	bsp_StartHardTimer(1,100,Check_Frame_Interval);							//Ã¿100uSµ÷ÓÃÒ»´ÎÖ¡¼ä¸ô¼ì²â	
																																				
	__set_PRIMASK(0);										//¿ªÆô×ÜÖÐ¶Ï
	
	//======================================================================
	//²»ÒªÅ²¶¯Î»ÖÃ
	bsp_InitIwdg(2000);																				//Ê¹ÄÜ¿´ÃÅ¹·
	if((Dev.err & ERR_RESET)==0x00)IWDG_Feed();
	//=======================================================================

	/* ½øÈëÖ÷³ÌÐòÑ­»·Ìå */
	while (1)
	{
		/* ÈÎÎñÖ´ÐÐº¯Êý */
		hSCH_Dispatch_Tasks();
	}
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: AppTask_RivalrySend
*	¹¦ÄÜËµÃ÷: ×ÜÏß¾ºÕù·¢ËÍ
*	ÐÎ    ²Î£ºÎÞ
*	·µ »Ø Öµ: ÎÞ
*********************************************************************************************************
*/
void AppTask_RivalrySend(void)
{
		IT1_SendData();
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: taskRxProcess
*	¹¦ÄÜËµÃ÷: ÈÎÎñº¯Êý£¬ÓÃÓÚ×ÜÏß½ÓÊÕµ½µÄ´¦Àí
*	ÐÎ    ²Î£ºÎÞ
*	·µ »Ø Öµ: ÎÞ
*********************************************************************************************************
*/
static void taskRxProcess(void)
{

	if((Bus.SelfSend==0)&&(Bus.rxok==1))
	{
		Bus.rxok=0;

		IT1_ParseFrame();	
		
		Bus.distime=3;												//×ÜÏß×èÈû
		    
		//Èç¹ûÓÐÓ¦´ðÒªÇó£¬ÔòÓ¦´ð(´Ë´¦Ö±½ÓÓ¦´ð£¬²»ÅÐ¶Ï×ÜÏß)
		if(TxDat.f_tx==1)
		{					
					RS485_Send(TxDat.buf,TxDat.cnt);								
		    	TxDat.f_tx=0;		
		}
	}
}


/*
*********************************************************************************************************
*	º¯ Êý Ãû: AppTask_BusMonitor
*	¹¦ÄÜËµÃ÷: ÈÎÎñº¯Êý£¬ÓÃÓÚ×ÜÏßµÄ¼à¿Ø
*	ÐÎ    ²Î£ºÎÞ
*	·µ »Ø Öµ: ÎÞ
*********************************************************************************************************
*/
//×ÜÏß¼à¿Ø³ÌÐò£¬²»¿É¶ÂÈû£¬Ã¿1mSµ÷ÓÃÒ»´Î
void AppTask_BusMonitor(void)
{

	if(Bus.distime>0)Bus.distime--;															//×ÜÏß½ûÖ¹Ê±¼ä
	//if(Bus.interval<10)Bus.interval++;													//×ÜÏßÖ¡Ö®¼ä¼ä¸ôÊ±¼ä
	if(Bus.time<200)Bus.time++;																	//×ÜÏß¿ÕÏÐÊ±¼ä
	if(Bus.timeout<250)Bus.timeout++;
	Dev.rand++;	
	

// 	 //Õâ¸ö³£Á¿È¡µÃ¹ý´ó£¬»áÊ¹×Ô·¢×ÔÊÕºÍÓ¦´ð·½µÄÓ¦´ðÕ³ºÏÔÚÒ»Æð¡£
// 	 //µ«¹ýÐ¡µÄ»°£¬Èç¹û·¢ËÍ·½·¢ËÍÊ±ÓÐÖÐ¶Ïµ¼ÖÂÒ»Ö¡Êý¾ÝÓÐÐ¡¼ä¸ô£¬ÕâÀï»á¿´×öÊÇÁ½Ö¡£¬¶øÒýÆð´íÎó¡  ²âÊÔÊ±ÖØµã²âÊÔ
//   if(Bus.interval==2)
// 	{
// 		Bsp_Get_UsartData(&RxDat.buf[0],&RxDat.cnt);
// 		Bus.rxok=1;																								//½ÓÊÕµ½Ò»Ö¡Êý¾Ý
// 	}	
}
//===============================================================================================
void Check_Frame_Interval(void)
{
		if(Bus.interval<100)Bus.interval++;
    if(Bus.interval==20)
	  {
				Bsp_Get_UsartData(&RxDat.buf[0],&RxDat.cnt);
				Bus.rxok=1;																								//½ÓÊÕµ½Ò»Ö¡Êý¾Ý
		}		
	  bsp_StartHardTimer(1,100,Check_Frame_Interval);
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: AppTask_WirelessRecv
*	¹¦ÄÜËµÃ÷: ½ÓÊÕÎÞÏßÊý¾Ý£¬²¢´¦Àí
*	ÐÎ    ²Î£ºÎÞ
*	·µ »Ø Öµ: ÎÞ
*********************************************************************************************************
*/
void AppTask_WirelessRecv(void)
{
		//static uint8_t cnt1=0;
	
	   //cnt1++;
	   //if(cnt1>=10)
		 {
		 //	    cnt1=0;
					Wireless_Recv();																				//Ã»10ms²éÑ¯Ò»´Î			
		 }
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: AppTask_WirelessRecv
*	¹¦ÄÜËµÃ÷: ½ÓÊÕÎÞÏßÊý¾Ý£¬²¢´¦Àí
*	ÐÎ    ²Î£ºÎÞ
*	·µ »Ø Öµ: ÎÞ
*********************************************************************************************************
*/
void AppTask_WirelessSend(void)
{
		static uint8_t cnt=0;
	  //uint8_t buf[16];
	
	  cnt++;
	  if(cnt>=5)
		{
				cnt=0;
				Wireless_Send();																				//Ã»100ms²éÑ¯Ò»´Î
		}
}

/*
*********************************************************************************************************
*	º¯ Êý Ãû: AppTask_LedToggle
*	¹¦ÄÜËµÃ÷: ËÄ¸öLEDÉÁË¸µÄ³ÌÐò
*	ÐÎ    ²Î£ºÎÞ
*	·µ »Ø Öµ: ÎÞ
*********************************************************************************************************
*/
void AppTask_Run(void)
{
	static uint8_t t10ms,t100ms;
	static uint8_t ttest;
	uint8_t key,i,lin,row;
		
	t10ms++;
	bsp_KeyScan();													//°´¼üÂÖÑ¯
	led_run();
	
	IT1_IR_LoadToWireless(Ir.addr);					//·Ö°üÊý¾Ý·¢ËÍ
	
	
	//============================================================
	//×¢²á¼ä¸ôºÍÉÁË¸´¦Àí
	if(Dev.stu==DEV_REGISTER)
	{
				if(Reg.wait==0)
				{
						Reg.time=Reg.cnt*4;
						if(Reg.cnt<245)Reg.cnt++;
						Reg.wait=1; 
				}
				else
				{
						if(Reg.time>0)Reg.time--;
				}
	}
	if((Dev.stu==DEV_REGISTER)&&(Reg.time==0)&&(Reg.fullflag==0))
	{
				IT1_Dev_Register();
				Reg.wait=0;
	}
	//============================================================================
	//Èç¹ûÊÇËø£¬±ØÐëÉÏ±¨Ò»´Î×´Ì¬
	if((lock.report==0)&&(Dev.stu>DEV_REGISTER))
	{
				//1.²éÑ¯ÎÞÏßËøµÄ×´Ì¬
				//2.Êµ¼ÊÖ´ÐÐÊ±ÓÐÎÞÏß×ª·¢ÉÏ±¨
				IT1_Lock_DataLoad(0,0x01,0x01);
		    //ÉÏ±¨Ö¸ÎÆÊ¹ÄÜºÍ½ûÖ¹×´Ì¬
		    for(i=0;i<8;i++)
				{
					  lin=i/8;
						row=i%8;
						if((Pannel.item[0].onoffbuf[lin]&(0x01<<row))!=0x00)
						{
									DlyEvent_handle(i+1,0x04,0x01,1000);
						}
				}
	}
	//============================================================================			
	//ÒÔÏÂÃ¿100mSµ÷ÓÃ	
	if(t10ms>=10)
	{
		  t10ms=0;
		  Dev.rand++;
			t100ms++;
		   if(lock.setkeytime>0)lock.setkeytime--;
		  if((Dev.err & ERR_RESET)==0x00)IWDG_Feed();										//Î¹¹·100ms
		
		  //===========================================================================
		  //ºìÍâÅäÖÃÊ±¼äÏÞ¶¨
		  if(Ir.sendtime>0)Ir.sendtime--;
		  if((Ir.sendtime==0)&&(Ir.flag==1))Ir.flag=0;
		  //===========================================================================
			//===========================================================================
			//°´¼üÅÐ¶Ï
			key=bsp_GetKey();
			if(key!=0x00)
			{
							if(key==1)
							{
									//Ir_SetupLoad_Test();			//²âÊÔ Ä£Äâ·¢ËÍºìÍâÊý¾Ý
								  //¿ØÖÆ×ª·¢Æ÷½øÈëÑ§Ï°54¼üÒ£¿ØÆ÷×´Ì¬
									if((Dev.type&0xf000)==0x3000)
									{
												IT1_LearnLock();
									}
									else
									{
												//IT1_Learn54Key();
												RegTimeClr();
												Dev.stu=DEV_REGISTER;				//ÖØÐÂ×¢²á
									}
							}
							else if(key==3)
							{
									
								  //54¼üÒ£¿ØÆ÷Ò²ÓÐ±¾ÉíÉ¾³ý
									//IT1_IR_UnLoadToWireless(0xff,0xff);
									if((Dev.type&0xf000)==0xb000)
									{
											//É¾³ý±¾Éí±í¸ñ
											Init_Pannel_Table();
											//É¾³ýµØÖ·
											Init_Ex_Table(ALL);
									}
									else if((Dev.type&0xf000)==0x3000)
									{
											//É¾³ýËø±í¸ñ
											Init_Lock_Table(ALL);
									}
								  Dev.learn_time=0;
									Dev.encode_time=0;
									Dev.stu=DEV_NORMAL;
								  Led_set(0,25,25,8,1);
								  Led_set(1,25,25,8,2);
							}
		  }
			//=============================================================================
			//ÑÓÊ±´¦Àí
			IT1_Dlytime_Handle();
			//=============================================================================
			//ÐÅºÅ»º³å´¦Àí 100mS
			Msg_hanndle();
			//=============================================================================
			//ÒÔÏÂÃ¿1000mS´¦Àí
		  if(t100ms>=10)
			{
						t100ms=0;		
				    //======================================================================
				    //Ê±¼äÀÛ»ý
						ttest++;
				    if(ttest>=2)										//²âÊÔÓÃ
						{
							    ttest=0;
									//Wireless_Data_Send(0,0);
									//wl_test_send();  //ceshi
									//Wireless_Lock_Action(0,0xcf);
						}
				    //=======================================================================
				    if(lock.waittime>0)lock.waittime--;
						if(Dev.power_time<100)Dev.power_time++;						// ÉÏµçÊ±¼ä			
				    if(Dev.encode_time>0)Dev.encode_time--;						//¶ÔÂëÊ±¼ä
						if(Dev.learn_time>0)Dev.learn_time--;							//Ñ§ÂëÊ±¼ä			
						if((Dev.stu==DEV_SETUP)&&(Dev.encode_time==0)&&(Dev.learn_time==0))
						{
								Dev.stu=DEV_NORMAL;
								Led_set(1,25,25,1,2);	
						}
						//=======================================================================
			}

	}
}

/*****************************  (END OF FILE) *********************************/
